import * as z from "zod";

const formSchema = z.object({
  name: z
    .string("نوع نام کاربری نامعتبر است.")
    .trim()
    .min(1, "نام کاربری الزامی است.")
    .min(8, "نام کاربری باید حداقل ۸ کاراکتر باشد.")
    .max(30, "نام کاربری نمی‌تواند بیشتر از ۳۰ کاراکتر باشد.")
    .regex(
      /^[a-zA-Z0-9_]+$/,
      "نام کاربری فقط می‌تواند شامل حروف انگلیسی، اعداد و _ باشد.",
    ),

  email: z
    .string("نوع ایمیل نامعتبر است.")
    .trim()
    .min(1, "ایمیل الزامی است.")
    .email("لطفاً یک ایمیل معتبر وارد کنید."),

  message: z
    .string("نوع پیام نامعتبر است.")
    .trim()
    .min(1, "پیام الزامی است.")
    .min(10, "پیام باید حداقل ۱۰ کاراکتر باشد.")
    .max(500, "پیام نمی‌تواند بیشتر از ۵۰۰ کاراکتر باشد."),
});

export default formSchema;
